{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report detailing image replacement, placeholder audit, and deployment checklist update with affected files and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for core frontend components, hooks, and configuration files.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment checklist covering pre- and post-deployment validation for the Valentine flow and static memory images.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables, dark mode values, and applying layout defaults.",
  "frontend/index.html": "Basic HTML shell with root div and script entry for the React app.",
  "frontend/src/App.tsx": "App root that renders the ValentineProposalFlow component.",
  "frontend/src/features/valentine/ConfettiOverlay.tsx": "Generates and animates 100 confetti elements, removing them after animation.",
  "frontend/src/features/valentine/FloatingHeartsBackground.tsx": "Periodically spawns floating animated heart elements and cleans them up.",
  "frontend/src/features/valentine/hooks/memoriesImagesStorage.ts": "LocalStorage helper for saving, loading, and clearing memory card image data URLs.",
  "frontend/src/features/valentine/hooks/useMemoriesImages.ts": "Deprecated hook returning static v2 memory image paths with no upload or storage logic.",
  "frontend/src/features/valentine/steps/AttentionStep.tsx": "Intro step showing an attention message and button to continue.",
  "frontend/src/features/valentine/steps/FinalQuestionStep.tsx": "Final step asking the Valentine question with YES/NO logic, confetti, and a moving NO button.",
  "frontend/src/features/valentine/steps/HelloStep.tsx": "Greeting step explaining the effort behind the website with a continue button.",
  "frontend/src/features/valentine/steps/LetterStep.tsx": "Letter-style message step leading into the final question.",
  "frontend/src/features/valentine/steps/MemoriesStep.tsx": "Displays three static memory images with captions and a button to advance.",
  "frontend/src/features/valentine/ValentineLayout.tsx": "Centered layout wrapper applying spacing and fade-in animation.",
  "frontend/src/features/valentine/ValentineProposalFlow.tsx": "Controls step progression and renders one of five Valentine flow steps with background effects.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor using the current identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login, logout, and stored identity loading.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode theming, and custom animations like floating hearts and confetti.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClient and InternetIdentity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, plugins, and extended theme values.",
  "project_state.json": "Tracks project configuration, features, issues, and image-generation requirements for the Valentine proposal site."
}