{
  "backend/main.mo": "Actor manages a map of words to translation lists with add, update, query, and delete operations.",
  "feature_evidence.json": "Feature evidence report mapping two rollback-related features to affected files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend Valentine feature files for reference.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Checklist verifying Valentine flow correctness, animations, responsiveness, and post-deployment behavior.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color variables, dark mode tokens, and base styling.",
  "frontend/index.html": "HTML entry point setting up the root element and loading the main TypeScript module.",
  "frontend/src/App.tsx": "App component that renders the ValentineProposalFlow.",
  "frontend/src/features/valentine/ConfettiOverlay.tsx": "Spawns and cleans up 100 falling confetti elements on mount.",
  "frontend/src/features/valentine/FloatingHeartsBackground.tsx": "Continuously spawns floating heart emojis that rise and self-remove.",
  "frontend/src/features/valentine/FlowerShowerOverlay.tsx": "Creates 50 falling flower emoji elements with randomized animation timing.",
  "frontend/src/features/valentine/hooks/memoriesImagesStorage.ts": "Empty placeholder file for memory image storage utilities.",
  "frontend/src/features/valentine/hooks/useMemoriesImages.ts": "Empty placeholder file for the memories image hook.",
  "frontend/src/features/valentine/steps/AttentionStep.tsx": "Intro step displaying attention message and button to proceed.",
  "frontend/src/features/valentine/steps/FinalQuestionStep.tsx": "Final step presenting YES/NO question and triggering confetti/flowers or playful message.",
  "frontend/src/features/valentine/steps/HelloStep.tsx": "Greeting step explaining effort behind the website with a continue button.",
  "frontend/src/features/valentine/steps/LetterStep.tsx": "Letter-style step with sentimental text and a button to proceed.",
  "frontend/src/features/valentine/steps/MemoriesStep.tsx": "Displays three static memory images with captions and a continue button.",
  "frontend/src/features/valentine/ValentineLayout.tsx": "Centered layout wrapper applying fade-in animation to step content.",
  "frontend/src/features/valentine/ValentineProposalFlow.tsx": "Controls the 5-step Valentine flow and renders the correct step with background hearts.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, logout, identity loading, and login status management.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables plus animations for hearts, confetti, flowers, and fade-in effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors tied to CSS variables, animations, and plugins.",
  "project_state.json": "Stores the project’s build state, requirements, issues, and architectural notes for the Valentine proposal website."
}