{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report linking a redeployment-related feature to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files and components.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment checklist verifying the Valentine proposal flow, interactions, responsiveness, and performance.",
  "frontend/index.css": "Tailwind base and theme variables defining OKLCH color system and global styling.",
  "frontend/index.html": "Basic HTML template mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "App root that renders the ValentineProposalFlow component.",
  "frontend/src/features/valentine/ConfettiOverlay.tsx": "Creates 100 falling confetti pieces and cleans them up after animation.",
  "frontend/src/features/valentine/FloatingHeartsBackground.tsx": "Spawns floating heart elements at intervals and removes them after animation.",
  "frontend/src/features/valentine/hooks/useMemoriesImages.ts": "Manages memory card images with localStorage persistence, upload, and reset functions.",
  "frontend/src/features/valentine/steps/AttentionStep.tsx": "Intro step displaying an attention message and button to continue.",
  "frontend/src/features/valentine/steps/FinalQuestionStep.tsx": "Final step with YES/NO buttons, moving NO behavior, confetti, and response messages.",
  "frontend/src/features/valentine/steps/HelloStep.tsx": "Second step with a greeting and button to proceed.",
  "frontend/src/features/valentine/steps/LetterStep.tsx": "Fourth step showing a short letter and a button to continue.",
  "frontend/src/features/valentine/steps/MemoriesStep.tsx": "Third step showing three memory cards with upload and reset controls.",
  "frontend/src/features/valentine/ValentineLayout.tsx": "Centered layout wrapper applying fade‑in animation to child content.",
  "frontend/src/features/valentine/ValentineProposalFlow.tsx": "Controls the 5‑step Valentine flow and renders steps based on current state.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor tied to Internet Identity, refetching when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status handling using Dfinity AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom theme with pink/rose color variables plus animations for hearts, confetti, and fade-in effects.",
  "frontend/src/main.tsx": "Bootstraps the React app by rendering App inside QueryClientProvider and InternetIdentityProvider, and imports global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors derived from CSS variables, extended animations, typography, container settings, and plugin integrations.",
  "project_state.json": "Tracks project metadata and requirements for building a romantic multi-step Valentine proposal site, including features, issues, and architectural notes."
}