{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "JSON report placeholder listing no features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend source files.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment checklist verifying the 5‑step Valentine flow and interactive features work correctly.",
  "frontend/index.css": "Tailwind base styles plus OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Basic HTML shell mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Renders the ValentineProposalFlow as the root component.",
  "frontend/src/features/valentine/ConfettiOverlay.tsx": "Generates 100 falling confetti elements and cleans them up after animation.",
  "frontend/src/features/valentine/FloatingHeartsBackground.tsx": "Continuously spawns floating heart emojis that rise and auto-remove.",
  "frontend/src/features/valentine/hooks/useMemoriesImages.ts": "Manages three memory images with upload, reset, and localStorage persistence.",
  "frontend/src/features/valentine/steps/AttentionStep.tsx": "Intro step with attention message and button to proceed.",
  "frontend/src/features/valentine/steps/FinalQuestionStep.tsx": "Final step showing YES/NO buttons, moving NO button, confetti, and response messages.",
  "frontend/src/features/valentine/steps/HelloStep.tsx": "Greeting step explaining effort behind the website with a button to continue.",
  "frontend/src/features/valentine/steps/LetterStep.tsx": "Letter-style message step building anticipation before the question.",
  "frontend/src/features/valentine/steps/MemoriesStep.tsx": "Displays three memory cards with image upload/reset and persistent storage.",
  "frontend/src/features/valentine/ValentineLayout.tsx": "Centered layout wrapper applying fade-in animation to children.",
  "frontend/src/features/valentine/ValentineProposalFlow.tsx": "Controls the 5‑step Valentine flow, switching steps and showing background hearts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, storing identity state, and exposing login/clear helpers with status flags.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, theme variables, dark mode values, and custom animations like floating hearts, confetti fall, and fade‑in.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, content scanning, theme extensions, custom colors mapped to CSS variables, and extra animations and utilities.",
  "project_state.json": "Tracks project metadata, requirements, and issues for building a romantic multi-step Valentine proposal site with animations and interactions."
}